       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWRL.

       PROCEDURE DIVISION.
           DISPLAY "Hello world!".
           STOP RUN.
